Revit 2027 API
Form.IsEdgeReference Method
Tell if the pick is the reference to an edge of the form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEdgeReference(
	Reference edgeReference
)
Public Function IsEdgeReference (
	edgeReference As Reference
) As Boolean
public:
bool IsEdgeReference(
	Reference^ edgeReference
)
member IsEdgeReference :
        edgeReference : Reference -> bool
Parameters
edgeReference Reference
Reference to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace